Revit 2024 API
Schema.ReadAccessLevel Property
 Read access level of the schema.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public AccessLevel ReadAccessLevel { get; }
Visual Basic
Public ReadOnly Property ReadAccessLevel As AccessLevel
	Get
Visual C++
public:
property AccessLevel ReadAccessLevel {
	AccessLevel get ();
}
See Also
Schema Class
Autodesk.Revit.DB.ExtensibleStorage Namespace